{
  "last_updated": "2025-11-28 08:15:06",
  "news": [
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "TOI Education",
      "title": "HPBOSE Class 10th, 12th datesheet 2025 released: Direct link to download here",
      "description": "The Himachal Pradesh Board of School Education has released the 2026 date sheets for Class 10 and Class 12 board exams, scheduled to begin on March 3. Class 10 papers will continue till March 28, while Class 12 exams will conclude on April 1. The board has al…",
      "url": "https://timesofindia.indiatimes.com/education/news/hpbose-class-10th-12th-datesheet-2025-released-direct-link-to-download-here/articleshow/125606454.cms",
      "urlToImage": "https://static.toiimg.com/thumb/msid-125606465,width-1070,height-580,imgsize-150412,resizemode-75,overlay-toi_sw,pt-32,y_pad-500/photo.jpg",
      "publishedAt": "2025-11-27T06:07:47Z",
      "content": "The Himachal Pradesh Board of School Education has released the 2026 date sheets for Class 10 and Class 12 board exams, scheduled to begin on March 3. Class 10 papers will continue till March 28, whi… [+2217 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Ndtvprofit.com"
      },
      "author": "PTI",
      "title": "Himachal Pradesh Government To Conduct Recruitment Drive For Jobs In UAE",
      "description": "The Himachal Pradesh State Electronics Development Corporation is set to organise a special recruitment drive for 300 delivery riders in the United Arab Emirates (UAE) in the first week of next month. An official spokesperson on Tuesday informed that the stat…",
      "url": "https://www.ndtvprofit.com/business/himachal-pradesh-government-to-conduct-recruitment-drive-for-jobs-in-uae",
      "urlToImage": "https://media.assettype.com/bloombergquint%2F2024-08-10%2F16h16jr7%2Fjob-search-with-job-sign_104165-18.avif?rect=0%2C52%2C900%2C473&w=1200&auto=format%2Ccompress&ogImage=true",
      "publishedAt": "2025-11-25T16:33:19Z",
      "content": "\"The recruitment is being conducted by HPSEDC, in collaboration with the Department of Labour &amp; Employment, and a recruitment agency registered with the Union Ministry of External Affairs (MEA). … [+157 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ET Online",
      "title": "Dreaming of working abroad? HP govt launches UAE job drive with monthly earnings up to Rs 1 lakh: Check details inside",
      "description": "The Himachal Pradesh State Electronics Development Corporation is organising a special recruitment drive for 300 delivery rider positions in the United Arab Emirates. This initiative offers new overseas employment opportunities for the youth of Himachal Prade…",
      "url": "https://economictimes.indiatimes.com/news/new-updates/dreaming-of-working-abroad-hp-govt-launches-uae-job-drive-with-monthly-earnings-up-to-rs-1-lakh-check-details-inside/articleshow/125568320.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125568352,width-1200,height-630,imgsize-1125154,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-11-25T15:54:05Z",
      "content": "The Himachal Pradesh State Electronics Development Corporation (HPSEDC) is set to organise a special recruitment drive for 300 delivery rider positions in the United Arab Emirates (UAE) in the first … [+2031 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Express News Service",
      "title": "Himachal Pradesh announces new job opportunity: 300 delivery rider posts in UAE",
      "description": "A state spokesperson said that the Himachal Pradesh State Electronics Development Corporation (HPSEDC) is organising a special recruitment drive for 300 delivery rider posts with Noon Food LLC in the United Arab Emirates (UAE).",
      "url": "https://indianexpress.com/article/cities/chandigarh/himachal-pradesh-new-job-opportunity-delivery-rider-posts-uae-10385598/",
      "urlToImage": "https://images.indianexpress.com/2025/11/Delivery-agent.jpg",
      "publishedAt": "2025-11-25T13:47:35Z",
      "content": "The Himachal Pradesh government has announced a new overseas employment opportunity for the youth of the state.A state spokesperson said that the Himachal Pradesh State Electronics Development Corpor… [+1408 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ANI",
      "title": "Himachal cabinet raises disaster relief to Rs 8 lakh, clears major recruitments; panchayat poll delay issue still sub judice",
      "description": "Himachal Pradesh Cabinet approved a Rs 1 lakh hike in disaster relief, raising compensation for destroyed homes to Rs 8 lakh. Major recruitment drives for health, police, and engineering roles were also cleared. The government also greenlit a 40% subsidy for …",
      "url": "https://economictimes.indiatimes.com/news/india/himachal-cabinet-raises-disaster-relief-to-rs-8-lakh-clears-major-recruitments-panchayat-poll-delay-issue-still-sub-judice/articleshow/125540575.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125540604,width-1200,height-630,imgsize-80472,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-11-24T12:01:19Z",
      "content": "The Himachal Pradesh Cabinet on Monday approved a significant increase in disaster relief assistance, raised major recruitment proposals, and cleared multiple administrative decisions, even as the po… [+1822 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Statetimes.in"
      },
      "author": "statetimes_editor",
      "title": "Wife’s final salute and a heartbreaking farewell; Wing Commander Syal cremated",
      "description": "SHIMLA: Sobbing inconsolably, the IAF officer wife of Wing Commander Namansh Syal, died in the Tejas crash at the Dubai Air show, managed a farewell salute with their six-year-old daughter clinging to her as his mortal remains were consigned to flames in Hima…",
      "url": "https://statetimes.in/wifes-final-salute-and-a-heartbreaking-farewell-wing-commander-syal-cremated/",
      "urlToImage": "https://statetimes.in/wp-content/uploads/2025/11/Wing-Commander-Syal-cremated-6-820x1024.jpg",
      "publishedAt": "2025-11-23T16:28:03Z",
      "content": "SHIMLA: Sobbing inconsolably, the IAF officer wife of Wing Commander Namansh Syal, died in the Tejas crash at the Dubai Air show, managed a farewell salute with their six-year-old daughter clinging t… [+2039 chars]"
    }
  ],
  "directory": []
}