{
  "last_updated": "2025-11-22 16:10:22",
  "news": [
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ET Online",
      "title": "Tejas pilot death: Who was Wing Commander Namansh Syal, Himachal’s brave IAF officer killed in Dubai Air Show crash?",
      "description": "Tejas pilot death: Wing Commander Namansh Syal tragically died when an LCA Tejas fighter jet crashed during an aerial display at the Dubai Air Show. The indigenous aircraft nosedived, erupting in a fireball, marking the first fatal incident for the Tejas duri…",
      "url": "https://economictimes.indiatimes.com/news/defence/tejas-pilot-death-who-was-wing-commander-namnash-syal-himachals-brave-iaf-officer-killed-in-dubai-air-show-crash/articleshow/125489988.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125490032,width-1200,height-630,imgsize-541577,overlay-etdefence/articleshow.jpg",
      "publishedAt": "2025-11-21T16:00:51Z",
      "content": "Tejas pilot death: India is mourning the tragic loss of Wing Commander Namansh Syal, the Indian Air Force pilot from Kangra district in Himachal Pradesh, who died after an LCA Tejas fighter jet crash… [+3098 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "PTI",
      "title": "Telangana, HP's drone policies be studied for replication in Delhi: L-G Saxena to chief secy after Red Fort blast",
      "description": "Delhi Lieutenant Governor V K Saxena is examining drone policies from Telangana and Himachal Pradesh. This follows a recent blast near the Red Fort. The move aims to enhance security and balance development with safety. The government is also looking into bac…",
      "url": "https://economictimes.indiatimes.com/news/india/telangana-hps-drone-policies-be-studied-for-replication-in-delhi-l-g-saxena-to-chief-secy-after-red-fort-blast/articleshow/125486215.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125486240,width-1200,height-630,imgsize-118202,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-11-21T12:11:24Z",
      "content": "New Delhi: Lieutenant Governor V K Saxena has directed the Delhi chief secretary to examine the possibility of replicating the drone policies of Telangana and Himachal Pradesh in the national capital… [+3439 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "PTI",
      "title": "Sanjauli mosque row: Protest and hunger strike until death called off after 'demands met'",
      "description": "A Hindu group has called off its protest in Shimla after the administration reportedly agreed to seal an illegal mosque. The Devbhoomi Sangharsh Samiti's demands included immediate sealing, disconnection of utilities, and withdrawal of an FIR. A hunger strike…",
      "url": "https://economictimes.indiatimes.com/news/politics-and-nation/sanjauli-mosque-row-protest-and-hunger-strike-until-death-called-off-after-demands-met/articleshow/125483586.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125483635,width-1200,height-630,imgsize-100030,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-11-21T10:09:51Z",
      "content": "Demanding the immediate sealing of the Sanjauli mosque here, which has been declared illegal by a court, the Devbhoomi Sangharsh Samiti on Friday called off their protest and said their demands were … [+2199 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Saurabh Parashar",
      "title": "Himachal to handover 2.7427 ha of non-forest land for Shimla Ropeway",
      "description": "Given the land’s non-forest nature, RTDC and the state will not require permission from MoEFCC",
      "url": "https://indianexpress.com/article/cities/chandigarh/himachal-to-handover-2-7427-ha-of-non-forest-land-for-shimla-ropeway-10372888/",
      "urlToImage": "https://images.indianexpress.com/2025/11/shimla_20251118152504.jpg",
      "publishedAt": "2025-11-18T14:58:24Z",
      "content": "Along with the 6.1909 hectares of forest land in Shimla, the Himachal Pradesh government is also in the process of handing over 2.7427 hectares of non-forest land for the 13.73 km-long Shimla ropeway… [+3248 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Saurabh Parashar",
      "title": "Shimla ropeway clears key hurdle as 820 trees face the axe",
      "description": "According to the Forest Survey of India’s 2021 assessment, 47.21 percent of Shimla’s 5,131 sq km geographical area is under forest cover.",
      "url": "https://indianexpress.com/article/cities/chandigarh/shimla-ropeway-trees-face-the-axe-10371174/",
      "urlToImage": "https://images.indianexpress.com/2025/11/Himachal-4.jpg",
      "publishedAt": "2025-11-17T15:12:27Z",
      "content": "The forests that cradle Shimla with their misty slopes and deodar-scented ridges may soon lose a slice of their quiet canopy. About 820 trees are set to be felled across 6.1990 hectares of forest lan… [+4079 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Statetimes.in"
      },
      "author": "statetimes_editor",
      "title": "Yudhvir Sethi asks students to chase their goals with confidence",
      "description": "STATE TIMES NEWS JAMMU: DBN Mubarak Mandi celebrated its Annual Day on Sunday with great enthusiasm and patriotic fervour on the school premises. This year’s theme, “Operation Sindoor,” highlighted the courage, sacrifice and unwavering love of the Indian Arme…",
      "url": "https://statetimes.in/yudhvir-sethi-asks-students-to-chase-their-goals-with-confidence/",
      "urlToImage": "https://statetimes.in/wp-content/uploads/2025/11/Yudhvir-1-1.jpg",
      "publishedAt": "2025-11-16T18:41:08Z",
      "content": "STATE TIMES NEWS\r\n JAMMU: DBN Mubarak Mandi celebrated its Annual Day on Sunday with great enthusiasm and patriotic fervour on the school premises. This year’s theme, “Operation Sindoor,” highlighted… [+2794 chars]"
    }
  ],
  "directory": []
}