{
  "last_updated": "2025-12-05 00:49:44",
  "news": [
    {
      "source": {
        "id": null,
        "name": "Statetimes.in"
      },
      "author": "statetimes_editor",
      "title": "Northern Railways to resume operation of narrow gauge trains in Kangra Valley",
      "description": "JAMMU: The Northern Railways will resume the operation of narrow gauge trains in the Kangra Valley of Himachal Pradesh from December 5, officials said. Train services in Himachal Pradesh were suspended following heavy rains and landslides in September this ye…",
      "url": "https://statetimes.in/northern-railways-to-resume-operation-of-narrow-gauge-trains-in-kangra-valley/",
      "urlToImage": "https://statetimes.in/wp-content/uploads/2025/12/narrow-gauge-trains-india.jpg",
      "publishedAt": "2025-12-03T18:01:23Z",
      "content": "JAMMU: The Northern Railways will resume the operation of narrow gauge trains in the Kangra Valley of Himachal Pradesh from December 5, officials said.\r\nTrain services in Himachal Pradesh were suspen… [+993 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Saurabh Parashar",
      "title": "‘Hired senior advocates to protect interests of Himachal, will continue to do so’: Sukhu",
      "description": "Speaking during the Question Hour, Sukhu informed the House that the state government will continue to hire the senior advocates on the basis of their expertise to protect the interests of the state.",
      "url": "https://indianexpress.com/article/cities/chandigarh/senior-advocates-protect-interests-state-sukhu-10398641/",
      "urlToImage": "https://images.indianexpress.com/2025/12/ch1953189.jpg",
      "publishedAt": "2025-12-02T14:54:40Z",
      "content": "Chief Minister Sukhvinder Singh Sukhu Tuesday defended the hiring of senior advocates, including Abhishek Manu Singhvi and Kapil Sibal, to present legal matters related to Himachal Pradesh in the hig… [+2185 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Saurabh Parashar",
      "title": "Will draw a Re1 salary until Himachal emerges from financial crisis: BJP MLA Prakash Rana",
      "description": "The reduction in capital expenditure and a minuscule increase in the budget size by mere Rs 71 crore over last year clearly reflects the fiscal stress the state is facing.",
      "url": "https://indianexpress.com/article/cities/chandigarh/will-draw-a-re1-salary-until-himachal-emerges-from-financial-crisis-bjp-mla-prakash-rana-10397395/",
      "urlToImage": "https://images.indianexpress.com/2025/12/Untitled-design-13.png",
      "publishedAt": "2025-12-02T06:41:54Z",
      "content": "A BJP MLA Monday informed the Vidhan Sabha that he will take drawn only Re 1 as salary till Himachal Pradesh does not come out of the financial crisis.Participating in a debate on the issue of natura… [+3133 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "Trending Desk",
      "title": "Bengaluru weather update: Why Bangalore feels like Shimla and will the city see more chilly days ahead? Check IMD prediction",
      "description": "Bengaluru is set to experience cooler temperatures and light rain in the first week of December, influenced by Cyclone Ditwah's impact on the Tamil Nadu coast. The temperatures in Bengaluru have dropped significantly and the city might experience moderate rai…",
      "url": "https://economictimes.indiatimes.com/news/new-updates/bengaluru-weather-update-why-bangalore-feels-like-shimla-and-will-the-city-see-more-chilly-days-ahead-check-imd-prediction/articleshow/125708607.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125708643,width-1200,height-630,imgsize-249938,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-02T03:35:12Z",
      "content": "Bengaluru is likely to experience significantly lower-than-normal temperatures and light rain in the first week of December due to the impact of cyclone Ditwah on the Tamil Nadu coast, the India Mete… [+3164 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "PTI",
      "title": "Himachal Pradesh govt facing acute financial crunch; MLAs have to wait for funds, hiked salaries: CM Sukhu",
      "description": "In a challenging financial landscape, MLAs in Himachal Pradesh must now exercise patience as they await their area development funds and proposed salary increases. Chief Minister Sukhvinder Singh Sukhu announced that due to dwindling central grants and tighte…",
      "url": "https://economictimes.indiatimes.com/news/politics-and-nation/himachal-pradesh-govt-facing-acute-financial-crunch-mlas-have-to-wait-for-funds-hiked-salaries-cm-sukhu/articleshow/125698243.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125698314,width-1200,height-630,imgsize-150990,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-01T15:48:53Z",
      "content": "Himachal Pradesh MLAs shall have to wait for release of the third installment of local area development fund and their enhanced salaries and allowances as the state is facing acute financial crisis, … [+2111 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "Trending Desk",
      "title": "Anand Mahindra shares ‘unreal’ view of a Mandir in Himachal that looks like Switzerland, here's how you can reach this place",
      "description": "Anand Mahindra shared a breathtaking image of Rishi Parashar Mandir in Mandi, Himachal Pradesh, calling its beauty 'almost unreal.' The industrialist revealed a personal connection, regretting not visiting the region his late aunt praised. This blend of famil…",
      "url": "https://economictimes.indiatimes.com/news/new-updates/anand-mahindra-shares-unreal-view-of-a-mandir-in-himachal-that-looks-like-switzerland-heres-how-you-can-reach-this-place/articleshow/125690832.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-125691292,width-1200,height-630,imgsize-120386,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-01T10:08:42Z",
      "content": "Anand Mahindra shared a stunning image of the Rishi Parashar Mandir in Mandi, Himachal Pradesh a frame he described as so beautiful that it felt almost unreal. The industrialist posted the photo on X… [+3658 chars]"
    }
  ],
  "directory": []
}