{
  "last_updated": "2025-12-27 12:18:20",
  "news": [
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Saurabh Parashar",
      "title": "Shimla doctor’s dismissal sparks mass leave protest; IGMC services hit",
      "description": "A delegation of the Resident Doctors’ Association, IGMC Shimla, met Chief Minister Sukhvinder Singh Sukhu, seeking that Senior Resident Dr Raghav Narula be reinstated.",
      "url": "https://indianexpress.com/article/cities/chandigarh/shimla-doctors-dismissal-sparks-mass-leave-protest-igmc-services-hit-10440084/",
      "urlToImage": "https://images.indianexpress.com/2025/12/IGMC-shimla-express-photo.jpg",
      "publishedAt": "2025-12-26T10:44:39Z",
      "content": "Patients at the Indira Gandhi Medical College and Hospital (IGMC), Shimla, faced significant inconvenience on Friday as resident doctors proceeded on mass casual leave across the city and other parts… [+3064 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ANI",
      "title": "Shimla targets drug networks; 50 repeat traffickers identified",
      "description": "Himachal Pradesh is waging a strong war against drugs. Shimla police are using a new strategy to stop drug sales on the streets. They are identifying frequent drug dealers and proposing their preventive detention. This aims to break drug supply chains and pro…",
      "url": "https://economictimes.indiatimes.com/news/india/shimla-targets-drug-networks-50-repeat-traffickers-identified/articleshow/126188294.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-126188346,width-1200,height-630,imgsize-58040,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-26T10:14:58Z",
      "content": "Shimla: The Himachal Pradesh government has launched an aggressive state-wide campaign to eradicate chitta (heroin) and other narcotics. Shimla district police have developed a new preventive policin… [+3996 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "ANI",
      "title": "Himachal CM Promises Fresh Probe Into Patient Assault Case; Doctors To Call Off Strike",
      "description": "Resident doctors in Himachal Pradesh will go on a day-long mass leave. This follows Chief Minister Sukhvinder Singh Sukhu's assurance of a fresh inquiry into a patient assault controversy. The controversy led to the termination of a senior resident doctor at …",
      "url": "https://economictimes.indiatimes.com/news/india/himachal-cm-promises-fresh-probe-into-patient-assault-case-doctors-to-call-off-strike/articleshow/126187408.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-126187476,width-1200,height-630,imgsize-111890,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-26T09:18:56Z",
      "content": "Shimla: As resident doctors across Himachal Pradesh had announced to proceed on a day-long mass leave on Friday, Chief Minister Sukhvinder Singh Sukhu assured a fresh inquiry into the patient assault… [+2113 chars]"
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "Hakeem Irfan Rashid",
      "title": "J&K leaders Mufti, Aga, Engineer Rashid demand action against people targeting Kashmiris in Uttarakhand, Himachal Pradesh",
      "description": "Kashmiri leaders voiced strong condemnation over assaults on traders in Uttarakhand and Himachal Pradesh, demanding swift legal action. Jailed MP Engineer Rashid and NC leader Aga Ruhullah Mehdi highlighted the violation of constitutional rights and human dig…",
      "url": "https://economictimes.indiatimes.com/news/politics-and-nation/jk-leaders-mufti-aga-engineer-rashid-demand-action-against-people-targeting-kashmiris-in-uttarakhand-himachal-pradesh/articleshow/126176418.cms",
      "urlToImage": "https://img.etimg.com/thumb/msid-126176415,width-1200,height-630,imgsize-1147005,overlay-economictimes/articleshow.jpg",
      "publishedAt": "2025-12-25T17:18:37Z",
      "content": "Kashmiri leaders expressed concern over the reports of assault on Kashmiri traders in Uttarakhand and Himachal Pradesh and urged the concerned governments to take legal action against the perpetrator… [+2944 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "Lokmattimes.com"
      },
      "author": "Ians",
      "title": "Himachal condemns Centre’s apple import policies - www.lokmattimes.com",
      "description": "Himachal condemns Centre’s apple import policies - Shimla, Dec 25 The Congress government in Himachal Pradesh on Thursday condemned the Union government's apple import policies, ... - Latest News. Find Breaking Headlines, Current and Latest business news at L…",
      "url": "https://www.lokmattimes.com/business/himachal-condemns-centres-apple-import-policies-1/",
      "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/1200x900/202512253619077_202512.jpg",
      "publishedAt": "2025-12-25T14:16:13Z",
      "content": "Shimla, Dec 25 The Congress government in Himachal Pradesh on Thursday condemned the Union governments apple import policies, saying successive decisions taken by it reflected a clear anti-farmer and… [+1983 chars]"
    },
    {
      "source": {
        "id": null,
        "name": "The Indian Express"
      },
      "author": "Express News Service",
      "title": "Assault at Shimla hospital: IGMC admn yet to submit probe report as another video surfaces",
      "description": "Latest video shows argument between patient and doctor",
      "url": "https://indianexpress.com/article/cities/chandigarh/assault-shimla-hospital-igmc-probe-report-video-surfaces-10437493/",
      "urlToImage": "https://images.indianexpress.com/2025/12/indian-express-logo-5_20251223051139_20251224040901.jpg",
      "publishedAt": "2025-12-24T15:51:48Z",
      "content": "Two days after the alleged assault on a patient by two doctors at Indira Gandhi Medical College and Hospital (IGMC) Shimla, a video of which went viral on social media, another video surfaced on Wedn… [+1959 chars]"
    }
  ],
  "directory": []
}